task2/p2_perfstat_v2.txt
sysbench 1.0.20 (using system LuaJIT 2.1.1761786044)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
1 files, 64MiB each
64MiB total file size
Block size 4KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using fast mmaped I/O mode
Doing random read test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      1897579.84
    writes/s:                     0.00
    fsyncs/s:                     0.00

Throughput:
    read, MiB/s:                  7412.42
    written, MiB/s:               0.00

General statistics:
    total time:                          5.0002s
    total number of events:              9491604

Latency (ms):
         min:                                    0.00
         avg:                                    0.00
         max:                                    0.22
         95th percentile:                        0.00
         sum:                                 3214.20

Threads fairness:
    events (avg/stddev):           9491604.0000/0.00
    execution time (avg/stddev):   3.2142/0.00


 Performance counter stats for 'sysbench fileio --file-num=1 --file-total-size=64M --file-test-mode=rndrd --file-io-mode=mmap --file-block-size=4K --time=5 run':

               821      page-faults                                                           
               821      minor-faults                                                          
           8754813      dTLB-load-misses                                                      
       13272642788      cycles                                                                
        7576257521      instructions                                                          

       5.007510411 seconds time elapsed

       4.998731000 seconds user
       0.006997000 seconds sys